fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_КоличествоДнейОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресИзДокумента = Параметры.АдресДокумента;
	
	Объект.ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(АдресИзДокумента));
	
	Объект.Год = Параметры.Год;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДиаграмму(Команда)
	
	ДиграммаОтпусков.Обновление = Ложь;
	
	ДиграммаОтпусков.Очистить();
	
	Для каждого Строка Из Объект.ОтпускаСотрудников Цикл 
		
		Точка = ДиграммаОтпусков.УстановитьТочку(Строка.Сотрудник); 
		Серия = ДиграммаОтпусков.УстановитьСерию("Отпуск");
		
		Значение = ДиграммаОтпусков.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();		
		Интервал.Начало = Строка.ДатаНачала;		
		Интервал.Конец = Строка.ДатаОкончания; 
		
		ДиграммаОтпусков.Обновление = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
